public class Main {
    public static void main(String[] args) {
        String text = "Знайти найбільшу кількість речень заданого тексту, в яких є однакові слова.\n" +
                "Вивести всі речення заданого тексту в порядку зростання кількості слів у них.\n" +
                "Знайти таке слово в першому реченні заданого тексту, якого не має в жодному з наступних.\n" +
                "В усіх питальних реченнях заданого тексту знайти та надрукувати без повторень слова заданої довжини.\n" +
                "В кожному реченні заданого тексту змінити місцями перше та останнє слово, не змінивши довжини речення.\n" +
                "Надрукувати слова без повторень заданого тексту в алфавітному порядку за першою літерою.\n" +
                "Відсортувати слова заданого тексту за зростанням кількості голосних літер.\n" +
                "Відсортувати слова заданого тексту, що починаються з голосних літер, за другою літерою.\n" +
                "Відсортувати слова заданого тексту за зростанням кількості в них заданої літери.\n" +
                "Задано текст та масив слів. Підрахувати у скількох реченнях зустрічається кожне слово масиву.\n" +
                "З кожного речення заданого тексту видалити підрядок найбільшої довжини, що починається та закінчується заданими літерами.\n" +
                "Із заданого тексту видалити всі слова визначеної довжини, що починаються з приголосної літери.\n" +
                "Відсортувати слова заданого тексту за кількістю входжень визначеного символу в них.\n" +
                "В заданому тексті знайти підрядок максимальної довжини, що є паліндромом, тобто читається однаково зліва на право та з права на ліво.\n" +
                "В кожному слові заданого тексту, видалити всі наступні входження першої літери цього слова.\n" +
                "В заданому тексті замінити слова заданої довжини визначеним рядком.\n" +
                "В кожному слові заданого тексту, видалити всі попередні входження останньої літери цього слова.";

    }
}